{
  "blogs": [
    {
      "title": "Technical requirements:",
      "body": "Use any framework of your choice (preferably React.js).\n\nMock the API delays instead of using static data.\n\nUpload your code to a public repository.\n\nDeploy your application and provide a url.\n\nWrite documentation for your application (Optional).\n\nWrite tests (Optional).\n\nAlso, if you have the opportunity to add more features and tricks to your application, please feel free to (Optional",
      "author": "yoshi",
      "id": 1
    },
    {
      "title": "noculating Against Fake News About COVID-19",
      "body": "The outbreak of the SARS-CoV-2 novel coronavirus (COVID-19) has been accompanied by a large amount of misleading and false information about the virus, especially on social media. In this article, we explore the coronavirus “infodemic” and how behavioral scientists may seek to address this problem. We detail the scope of the problem and discuss the negative influence that COVID-19 misinformation can have on the widespread adoption of health protective behaviors in the population. In response, we explore how insights from the behavioral sciences can be leveraged to manage an effective societal response to curb the spread of misinformation about the virus. In particular, we discuss the theory of psychological inoculation (or prebunking) as an efficient vehicle for conferring large-scale psychological resistance against fake news.\n\n",
      "author": "ahmed mahmoud",
      "id": 3
    }
  ],
  "comments": [
    {
      "body": "test new one",
      "author": "yoshi",
      "id": 4,
      "commentid": 2
    },
    {
      "body": "You should’ve included an example ",
      "author": "esasm mounir",
      "id": 1655723378327,
      "commentid": "3"
    },
    {
      "body": "nice tools :)",
      "author": "Mohamed ahmed",
      "id": 1655727420453,
      "commentid": "1"
    },
    {
      "body": "asdasd",
      "author": "aaa",
      "id": 1655730075477,
      "commentid": "1"
    },
    {
      "body": "rrrrrrrrrr",
      "author": "rrrrrrrrrrrrr",
      "id": 1655730088107,
      "commentid": "1"
    }
  ]
}